tutorials/viscoelasticFluidFoam/Giesekus/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Revision: exported                              |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1125;
        startFace       457575;
    }
    fixedWalls
    {
        type            wall;
        nFaces          4200;
        startFace       458700;
    }
    outlet
    {
        type            patch;
        nFaces          225;
        startFace       462900;
    }
    simetry
    {
        type            symmetryPlane;
        nFaces          21000;
        startFace       463125;
    }
    defaultFaces
    {
        type            empty;
        nFaces          0;
        startFace       484125;
    }
)

// ************************************************************************* //
